<!DOCTYPE html>

<html lang="fr" dir="ltr" xmlns="http://www.w3.org/1999/xhtml">

<head>

<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Tails - Annonce du contrat social de Tails</title>
<meta name="viewport" content="width=device-width, initial-scale=1" />

<link rel="icon" href="../favicon.ico" type="image/x-icon" />

<link rel="stylesheet" href="../style.css" type="text/css" />

<link rel="stylesheet" href="../local.css?reload-2021-06-25" type="text/css" />


<script src="../lib/js/mirror-dispatcher.js" type="text/javascript"></script>





<meta name="date" content="Tue, 09 May 2017 12:34:56 +0000" />



</head>


<body class="fr">


<div class="banner" role="banner">
  <a class="tails" href="../index.fr.html"><span>Tails</span></a>
  <div id="search-and-donate">
    
    
    
    <div class="donate">
      <a href="https://tails.boum.org/donate/?r=topbar" class="en"><span>Donate</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="de"><span>Spenden</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="es"><span>Donar</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="fa"><span>اهدا کردن</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="fr"><span>Faire un don</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="it"><span>Dona</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="pt"><span>Faça uma doação</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="ru"><span>Пожертвовать</span></a>
    </div>
  </div>
</div>



<div class="topbar" role="navigation">
<ul>
  <li><a href="../index.fr.html">Accueil</a></li>
  <li><a href="../about.fr.html">Fonctionnement de Tails</a></li>
  <li><a href="../install.fr.html">Obtenir Tails</a></li>
  <li><a href="../doc.fr.html">Documentation</a></li>
  <li><a href="../support.fr.html">Assistance</a></li>
  <li><a href="../contribute.fr.html">Participer</a></li>
  <li><a href="../news.fr.html">Nouvelles</a></li>
  <li><a href="../jobs.html">Postes &agrave; pourvoir</a></li>
</ul>


</div>



<div class="page">

<div class="pageheader">

<div class="parentlinks">
<ul id="crumbs">
<li><a href="../index.fr.html"><img alt="home" src="../lib/home.png"></a></li>







<li><a href="../news.fr.html">news</a></li>




<li>Annonce du contrat social de Tails</li>

</ul>
</div>


<div id="otherlanguages">
<ul>
   
   <li class="current">
   <span class="visible">Français
   </span>
   <span class="hidden">Français
()
   </span>
   </li>

   


   

   <li  class="master">

   <span class="visible"><a href="./social_contract.en.html">en</a></span>
   <span class="hidden"><a href="./social_contract.en.html">English</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./social_contract.de.html">de</a></span>
   <span class="hidden"><a href="./social_contract.de.html">Deutsch</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./social_contract.es.html">es</a></span>
   <span class="hidden"><a href="./social_contract.es.html">Español</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./social_contract.it.html">it</a></span>
   <span class="hidden"><a href="./social_contract.it.html">Italiano</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./social_contract.pt.html">pt</a></span>
   <span class="hidden"><a href="./social_contract.pt.html">Português</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./social_contract.ru.html">ru</a></span>
   <span class="hidden"><a href="./social_contract.ru.html">Русский</a></span>

   </li>
   
</ul>
</div>


<div class="header">
<span class="title">
Annonce du contrat social de Tails
</span>
<span class="date">2017-05-09</span>
</div>






</div>

<div id="pagebody">

<div id="content" role="main">
<p>Nous avions &eacute;crit et adopt&eacute; un <a href="../contribute/working_together/code_of_conduct.html">code de
conduite</a> d&egrave;s notre premier
hackfest public qui avait eu lieu &agrave; Paris en 2014. Ce code &eacute;tait et est
pr&eacute;vu comme un guide pour rendre nos espaces publics accueillants et amicaux
pour tous les &ecirc;tres sensibles.</p>

<p>Nous avons depuis travaill&eacute; sur un <a href="../doc/about/social_contract.fr.html">contrat
social</a> que nous avons la fiert&eacute; de vous
pr&eacute;senter aujourd&#39;hui !</p>




<p>Le contrat social de Tails est un ensemble d&rsquo;engagements que nous soutenons
en tant que personnes contribuant au projet Tails. Ce travail est d&eacute;riv&eacute; du
contrat social de Debian et du contrat social de Tor. Si vous avez des
questions ou des commentaires, n&#39;h&eacute;sitez pas &agrave; nous &eacute;crire : <a href="mailto:tails-project@boum.org">tails-project@boum.org</a>.</p>

<p>C&#39;est une promesse de notre communaut&eacute; envers le reste du monde, affirmant
notre engagement &agrave; nos valeurs.</p>

<h2>1. En cr&eacute;ant Tails nous essayons de fournir des outils accessibles pour l&#39;anonymat et la vie priv&eacute;e</h2>

<p>Nous croyons que la vie priv&eacute;e, l&rsquo;&eacute;change libre des id&eacute;es et l&rsquo;acc&egrave;s &eacute;gal &agrave;
l&rsquo;information sont essentiels aux soci&eacute;t&eacute;s libres et ouvertes. Au travers
des principes de notre communaut&eacute; et des outils que nous cr&eacute;ons, nous
fournissons des moyens qui permettent &agrave; tout le monde de prot&eacute;ger et de
faire progresser ces id&eacute;aux.</p>

<h2>2. Tails est et restera un logiciel libre</h2>

<p>L&#39;acc&egrave;s &eacute;gal &agrave; l&#39;information inclus la libre disponibilit&eacute; de notre code et
de notre documentation ainsi que la transparence de nos processus de prise
de d&eacute;cision.</p>

<p>Tous les &eacute;l&eacute;ments de Tails que nous cr&eacute;ons nous-m&ecirc;me sont, et seront, plac&eacute;s
sous des licences en coh&eacute;rence avec les <a href="https://www.debian.org/social_contract.fr.html">principes du logiciel libre selon
Debian</a>.</p>

<p>Tails sera toujours libre d&#39;&ecirc;tre utilis&eacute;, remix&eacute;, adapt&eacute; et distribu&eacute;. Comme
seules exceptions &agrave; cette r&egrave;gle, Tails inclut :</p>

<ul>
<li>une petite partie de micrologiciels non-libres dans le but de fonctionner
sur le plus de mat&eacute;riel possible ;</li>
<li>quelques morceaux de logiciels dont le code source est public mais non
compatible avec les principes du logiciel libre selon Debian ; ils sont
n&eacute;cessaires pour supporter des cas d&#39;usage importants.</li>
</ul>


<h2>3. Nous redonnerons &agrave; la communaut&eacute; du logiciel libre</h2>

<p>Tails est un <a href="https://wiki.debian.org/fr/Derivatives">d&eacute;riv&eacute; de Debian</a>
orient&eacute; vie priv&eacute;e.</p>

<p>Nous voulons que les outils de s&eacute;curit&eacute; et orient&eacute;s vie priv&eacute;e utilisables
deviennent un standard pour la communaut&eacute; du logiciel libre dans son
ensemble.</p>

<p>Corrections de bugs, am&eacute;liorations du code, cr&eacute;ation de paquets Debian,
ainsi que le travail sur les probl&egrave;mes d&#39;utilisabilit&eacute; seront envoy&eacute;s aux
projets en amont chaque fois que cela sera possible. De cette fa&ccedil;on, nos
modifications pourrons b&eacute;n&eacute;ficier &agrave; d&#39;autres et elles pourront &ecirc;tre
davantage am&eacute;lior&eacute;es, par un nombre de personnes plus important.</p>

<h2>4. Nous encourageons la participation et la transparence</h2>

<p>Nous voulons produire Tails d&#39;une fa&ccedil;on qui encourage la participation, ce
qui n&eacute;cessite de documenter publiquement ce qui peut &ecirc;tre am&eacute;lior&eacute;. Comme
Tails est cr&eacute;&eacute; d&#39;une mani&egrave;re transparente, tout le monde est encourag&eacute; &agrave;
participer, &agrave; l&#39;examiner et &agrave; signaler les probl&egrave;mes.</p>

<p>Pour faire que notre communaut&eacute; soit un endroit accueillant pour tout le
monde nous avons convenu d&#39;un <a href="../contribute/working_together/code_of_conduct.html">code de
conduite</a>.</p>

<h2>5. Nous ne nuirons jamais intentionnellement aux personnes utilisant Tails</h2>

<p>Nous ferons toujours de notre mieux pour cr&eacute;er des outils s&eacute;curis&eacute;s et
utilisables. Nous n&rsquo;inclurons jamais volontairement de porte d&eacute;rob&eacute;e ou de
logiciel malveillant ni nous ne coop&eacute;rerons avec une entit&eacute; voulant que nous
nuisions aux personnes utilisant Tails.</p>

<p>Des erreurs peuvent arriver parfois. Nous serons honn&ecirc;tes &agrave; ce sujet et nous
corrigerons celles affectant la s&eacute;curit&eacute; d&egrave;s qu&#39;elles nous seront signal&eacute;es.</p>

<p>Chaque fois que des probl&egrave;mes de s&eacute;curit&eacute; nous seront signal&eacute;s en priv&eacute;,
nous les testerons et nous nous assurerons de les corriger rapidement. Nous
informerons les personnes utilisant Tails &agrave; chaque fois qu&#39;un probl&egrave;me nous
sera signal&eacute; de cette fa&ccedil;on. Cependant, pour la s&eacute;curit&eacute; des personnes
utilisant Tails, nous pourrons ne pas divulguer un probl&egrave;me avoir d&#39;avoir
publi&eacute; un correctif.</p>

<h2>6. Nous donnons aux personnes utilisant Tails les moyens de d&eacute;cider &agrave; quel point elles peuvent faire confiance &agrave; Tails</h2>

<p>Nous encourageons les personnes utilisant Tails &agrave; s&#39;informer par elles-m&ecirc;mes
et &agrave; d&eacute;cider si Tails convient &agrave; leur cas d&#39;usage et &agrave; quel point elles
peuvent lui faire confiance. Nous travaillons avec attention pour garder
notre communaut&eacute; au courant, &agrave; travers plusieurs canaux de communication, &agrave;
propos de l&#39;&eacute;tat actuel de notre logiciel et de ses limites. Nous
encourageons les personnes utilisant Tails &agrave; lire notre documentation aussi
bien que des documentations tierces afin de prendre une d&eacute;cision &eacute;clair&eacute;e et
d&#39;engager un processus d&#39;apprentissage &agrave; propos des outils que nous
fournissons.</p>

<p>Nous fournissons et nous expliquons des m&eacute;thodes de v&eacute;rification afin que
tout le monde puisse &ecirc;tre s&ucirc;r d&#39;avoir t&eacute;l&eacute;charg&eacute; une copie authentique de
Tails.</p>

</div>







</div>

<div id="footer" class="pagefooter" role="contentinfo">

<div id="pageinfo">





<div class="tags">
Tags:

<a href="../tags/announce.html" rel="tag">announce</a>

</div>



<div id="backlinks">
Pages linking to this one:

<a href="../about.fr.html">about.fr</a>

<a href="./achievements_in_2018.fr.html">achievements in 2018.fr</a>


</div>






</div>
<div id="mirrorlist">Mirror: <a href="https://tails.boum.org/ikiwiki.cgi?do=goto&page=news/social_contract.fr">tails.boum.org</a></div>

<!-- from The Amnesic Incognito Live System -->
</div>

</div>

<script type="text/javascript">
  var linkelements = document.querySelectorAll('.use-mirror-pool');
  // Avoid a traceback if mirror-dispatcher.js is not available.
  if (typeof replaceUrlPrefixWithRandomMirror !== "undefined" && linkelements.length > 0) {
    replaceUrlPrefixWithRandomMirror(linkelements);
  }
</script>

</body>
</html>
