<!DOCTYPE html>

<html lang="fr" dir="ltr" xmlns="http://www.w3.org/1999/xhtml">

<head>

<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Tails - Compte-rendu du sommet Tails 2013</title>
<meta name="viewport" content="width=device-width, initial-scale=1" />

<link rel="icon" href="../favicon.ico" type="image/x-icon" />

<link rel="stylesheet" href="../style.css" type="text/css" />

<link rel="stylesheet" href="../local.css?reload-2021-06-25" type="text/css" />


<script src="../lib/js/mirror-dispatcher.js" type="text/javascript"></script>





<meta name="date" content="Fri, 09 Aug 2013 09:12:07 +0000" />



</head>


<body class="fr">


<div class="banner" role="banner">
  <a class="tails" href="../index.fr.html"><span>Tails</span></a>
  <div id="search-and-donate">
    
    
    
    <div class="donate">
      <a href="https://tails.boum.org/donate/?r=topbar" class="en"><span>Donate</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="de"><span>Spenden</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="es"><span>Donar</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="fa"><span>اهدا کردن</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="fr"><span>Faire un don</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="it"><span>Dona</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="pt"><span>Faça uma doação</span></a>
      <a href="https://tails.boum.org/donate/?r=topbar" class="ru"><span>Пожертвовать</span></a>
    </div>
  </div>
</div>



<div class="topbar" role="navigation">
<ul>
  <li><a href="../index.fr.html">Accueil</a></li>
  <li><a href="../about.fr.html">Fonctionnement de Tails</a></li>
  <li><a href="../install.fr.html">Obtenir Tails</a></li>
  <li><a href="../doc.fr.html">Documentation</a></li>
  <li><a href="../support.fr.html">Assistance</a></li>
  <li><a href="../contribute.fr.html">Participer</a></li>
  <li><a href="../news.fr.html">Nouvelles</a></li>
  <li><a href="../jobs.html">Postes &agrave; pourvoir</a></li>
</ul>


</div>



<div class="page">

<div class="pageheader">

<div class="parentlinks">
<ul id="crumbs">
<li><a href="../index.fr.html"><img alt="home" src="../lib/home.png"></a></li>







<li><a href="../news.fr.html">news</a></li>




<li>Compte-rendu du sommet Tails 2013</li>

</ul>
</div>


<div id="otherlanguages">
<ul>
   
   <li class="current">
   <span class="visible">Français
   </span>
   <span class="hidden">Français
()
   </span>
   </li>

   


   

   <li  class="master">

   <span class="visible"><a href="./summit_2013.en.html">en</a></span>
   <span class="hidden"><a href="./summit_2013.en.html">English</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./summit_2013.de.html">de</a></span>
   <span class="hidden"><a href="./summit_2013.de.html">Deutsch</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./summit_2013.es.html">es</a></span>
   <span class="hidden"><a href="./summit_2013.es.html">Español</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./summit_2013.it.html">it</a></span>
   <span class="hidden"><a href="./summit_2013.it.html">Italiano</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./summit_2013.pt.html">pt</a></span>
   <span class="hidden"><a href="./summit_2013.pt.html">Português</a></span>

   </li>
   

   <li >

   <span class="visible"><a href="./summit_2013.ru.html">ru</a></span>
   <span class="hidden"><a href="./summit_2013.ru.html">Русский</a></span>

   </li>
   
</ul>
</div>


<div class="header">
<span class="title">
Compte-rendu du sommet Tails 2013
</span>
<span class="date">2013-08-09</span>
</div>






</div>

<div id="pagebody">

<div id="content" role="main">
<p>Un groupe de personnes a pass&eacute; une dizaine de jours ensemble, en juillet, au
troisi&egrave;me sommet annuel de d&eacute;veloppeurs de Tails. Une bonne occasion pour
avoir de folles s&eacute;ances d&#39;informatique en chair et en os, ainsi que pour
discuter de vers o&ugrave; nous allons, et comment.</p>

<h1>Discussions</h1>

<p>Nous avons surtout discut&eacute; de la <strong>croissance du projet</strong> : &eacute;tant donn&eacute; le
nombre croissant d&#39;utilisateurs et notre cycle de sortie de version tr&egrave;s
court, c&#39;est un d&eacute;fi de maintenir le projet durable et maintenable dans le
moyen/long terme.</p>

<p>Notre prise en compte en est premi&egrave;rement refl&eacute;t&eacute;e par <a href="https://tails.boum.org/contribute/roadmap">notre <strong>feuille de route mise &agrave; jour</strong></a> : nous avons d&eacute;sormais une meilleure
vision de ce sur quoi nous voulons nous concentrer pour les prochaines versions majeures
de Tails : les &eacute;tapes pour la 1.0, 1.1 et 2.0 sont maintenant plut&ocirc;t bien d&eacute;finies, et nous
f&ucirc;mes assez audacieux pour brouillonner des objectifs pour la 3.0.</p>

<p>Un autre point cl&eacute; &agrave; ce propos est que nous avons besoin de <strong>rendre plus
facile de contribuer</strong> &agrave; Tails. Nous avons list&eacute; nombres d&#39;am&eacute;liorations qui
pourraient &ecirc;tre faites dans ce sens, en particulier <a href="https://labs.riseup.net/code/projects/tails/issues?query_id=115">sur le site
web</a>. Nous
avons &eacute;galement identifi&eacute; des domaines qui pourraient beaucoup b&eacute;n&eacute;ficier de
quelques nouveaux contributeurs. Nous publierons des appels &agrave; l&#39;aide cibl&eacute;s
dans les prochains mois.</p>

<p>Nous avons &eacute;galement <strong>repens&eacute; nos canaux de communications</strong> pour faciliter
l&#39;implication de nouveaux contributeurs, pour permettre plus de partage de
la charge de travail, et &ecirc;tre capable de fournir une meilleure assistance
aux utilisateurs. En bref :</p>

<ul>
<li>Nos listes de courriers &eacute;lectroniques voient passer beaucoup de trafic
ces jours-ci. Cela peut dissuader des gens de les lire. C&#39;est pourquoi
nous allons cr&eacute;er deux listes mail sp&eacute;cialis&eacute;es : une priv&eacute;e, chiffr&eacute;e,
qui recevra les rapports de bug, et une autre, publique, qui sera d&eacute;di&eacute;e
&agrave; l&#39;assistance des utilisateurs.</li>
<li>Une FAQ grandissante sera rassembl&eacute;e : ce sera un outil d&#39;aide en
self-service, et devrait rendre le travail d&#39;assistance moins r&eacute;p&eacute;titif.</li>
<li>Dans quelques mois, nous &eacute;valuerons comment tout &ccedil;a marche et
reconsid&eacute;rerons l&#39;assistance web, qui est report&eacute;e pour l&#39;instant.</li>
</ul>


<p>Cela dit, la liste mail tails-dev reste le canal de communication principal
pour le d&eacute;veloppement et les discussions &agrave; l&#39;&eacute;chelle du projet.</p>

<p>Ce sommet nous a offert la chance d&#39;<strong>&eacute;valuer et de red&eacute;finir les
processus</strong> que nous avions mis en place il y a un an, comme notre agenda
temporel de sortie de version et une politique strict de fusion de branche.</p>

<p>Pour finir, l&#39;exp&eacute;rience des <strong>r&eacute;unions publiques de d&eacute;veloppement</strong> sera
prolong&eacute;e, et nous continuerons &agrave; avoir des <strong>s&eacute;ances de Low Hanging
Fruits</strong> chaque mois. Ces s&eacute;ances ne sont pas seulement tr&egrave;s utiles afin
d&#39;am&eacute;liorer Tails, nous f&ucirc;mes &eacute;galement heureux de voir de nouvelles t&ecirc;tes
nous y rejoindre r&eacute;cemment. Nous esp&eacute;rons en voir plus &agrave; l&#39;avenir : ces
s&eacute;ances sont de bonnes occasions de <strong>commencer &agrave; contribuer</strong> &agrave; Tails !</p>

<h1>Hack</h1>

<p>Les heures de r&eacute;unions &eacute;taient certainement un moment n&eacute;cessaire du sommet,
mais nous avons &eacute;galement pass&eacute; une bonne partie de notre temps aux
activit&eacute;s pratiques. Heureusement Tails a une bonne marge de progression, et
nous n&#39;&eacute;tions donc jamais d&eacute;s&oelig;uvr&eacute;s.</p>

<p>Le changement technique le plus visible qui eu lieu durant le sommet est
sans doute <a href="https://labs.riseup.net/code/projects/tails">notre <strong>migration vers
Redmine</strong></a> pour g&eacute;rer nos
<a href="https://labs.riseup.net/code/projects/tails/issues?query_id=108">t&acirc;ches</a> et
nos <a href="https://tails.boum.org/contribute/roadmap">plans</a>. Nous n&#39;exploitons pas encore le plein
potentiel de Redmine, mais &ccedil;a nous semble d&eacute;j&agrave; beaucoup moins fouillis
qu&#39;auparavant. On esp&egrave;re que cela aidera d&#39;autres personnes &agrave; s&#39;investir !
Merci beaucoup &agrave; Riseup pour l&#39;h&eacute;bergement du Redmine que nous
utilisons. Veuillez noter que nous continuerons &agrave; utiliser ikiwiki pour nos
blueprints.</p>

<p>Profitant de Redmine, nous avons commenc&eacute; &agrave; classifier les t&acirc;ches de
mani&egrave;res utiles et diverses : par exemple <a href="https://labs.riseup.net/code/projects/tails/issues?query_id=112"><strong>les tickets
faciles</strong></a>
ne requi&egrave;rent pas trop de savoir interne &agrave; Tails pour &ecirc;tre solutionn&eacute;s, et
sont le moyen id&eacute;al pour commencer &agrave; s&#39;investir. En passant, d&#39;autres
requ&ecirc;tes personnalis&eacute;es fournissent des listes des t&acirc;ches impliquant de
<a href="https://labs.riseup.net/code/projects/tails/issues?query_id=113">l&#39;administration
syst&egrave;me</a> ou
du <a href="https://labs.riseup.net/code/projects/tails/issues?query_id=115">d&eacute;veloppement
web</a>.</p>

<p>Nous avons pass&eacute; du temps &agrave; lister les probl&egrave;mes rencontr&eacute;s avec les
premiers essais de <strong>Tails bas&eacute; sur Debian Wheezy</strong>. Ce qu&#39;il nous reste &agrave;
faire est d&eacute;sormais plus clair pour nous : <a href="https://gitlab.tails.boum.org/tails/tails/-/issues/6015">quelques douzaines de tickets</a> furent cr&eacute;&eacute;s. Avons-nous mentionn&eacute;
que toute forme d&#39;aide est la bienvenue ? :)</p>

<p>Nous avons &eacute;galement pris soin de notre <strong>installation de Jenkins</strong> : c&#39;est
de plus en plus proche de quelque chose que l&#39;on peut utiliser et sur lequel
compter pour une partie de notre flux de t&acirc;ches journali&egrave;res.</p>

<p>De nombreuses branches furent <strong>fusionn&eacute;es pour la version 0.20 &agrave; venir</strong>,
dont l&#39;installation de Dasher et une premi&egrave;re &eacute;tape vers le remplacement de
TrueCrypt.</p>

<p>La <strong>documentation de Pidgin et OTR</strong> a &eacute;t&eacute;
<a href="http://git.tails.boum.org/tails/tree/wiki/src/doc/anonymous_internet/pidgin.mdwn?h=doc/better-pidgin-and-otr-documentation">r&eacute;&eacute;crite</a>
afin d&#39;&ecirc;tre plus claire et plus pr&eacute;cise, tout comme notre explication de la
mani&egrave;re dont les pseudonymes sont g&eacute;n&eacute;r&eacute;s al&eacute;atoirement pour les comptes
Pidgin.</p>

<p>D&#39;autres &eacute;tapes ont &eacute;t&eacute; &eacute;galement franchies pour qu&#39;<strong>Iceweasel ne se lance
pas</strong> au d&eacute;marrage.</p>

<h1>La fin n&#39;est que le d&eacute;but</h1>

<p>Comme vous pouvez l&#39;imaginer, ce sommet f&ucirc;t aussi intense que les
pr&eacute;c&eacute;dents. Tails vit des moments d&eacute;cisifs, nous nous attendons &agrave; ce que
l&#39;ann&eacute;e prochaine soit plut&ocirc;t int&eacute;ressante. <em>Vous</em> pouvez peut-&ecirc;tre faire la
diff&eacute;rence, n&#39;h&eacute;sitez donc pas &agrave; <a href="../contribute.fr.html">rejoindre la danse</a> !</p>

</div>







</div>

<div id="footer" class="pagefooter" role="contentinfo">

<div id="pageinfo">







<div id="backlinks">
Pages linking to this one:

<a href="./report_2013_07.html">report 2013 07</a>


</div>






</div>
<div id="mirrorlist">Mirror: <a href="https://tails.boum.org/ikiwiki.cgi?do=goto&page=news/summit_2013.fr">tails.boum.org</a></div>

<!-- from The Amnesic Incognito Live System -->
</div>

</div>

<script type="text/javascript">
  var linkelements = document.querySelectorAll('.use-mirror-pool');
  // Avoid a traceback if mirror-dispatcher.js is not available.
  if (typeof replaceUrlPrefixWithRandomMirror !== "undefined" && linkelements.length > 0) {
    replaceUrlPrefixWithRandomMirror(linkelements);
  }
</script>

</body>
</html>
